//=============================================================================
//
// エネミーモデル処理 [enemy.h]
// Author : GP11A132_19_鈴木信歓
//
//=============================================================================
#pragma once

#include "main.h"
#include "model.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define ENEMY_MAX		(9)					// エネミーの数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct ENEMY
{
	D3DXVECTOR3			pos;				// モデルの位置
	D3DXVECTOR3			rot;				// モデルの向き(回転)
	D3DXVECTOR3			scl;				// モデルの大きさ(スケール)

	float				spd;				// 移動スピード

	DX11_MODEL			model;				// モデル情報

	D3DXMATRIX			mtxWorld;			// ワールドマトリックス

	int					shadowIdx;			// 影のインデックス番号
	bool				use;
	float				radius;
	float				time;				// 線形補間の時間管理用

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);

ENEMY *GetEnemy(void);