//=============================================================================
//
// モデル処理 [player.h]
// Author : GP11A132_19_鈴木信歓
//
//=============================================================================
#pragma once

#include "main.h"
#include "model.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define PLAYER_MAX		(1)					// プレイヤーの数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct PLAYER
{
	D3DXVECTOR3			pos;				// モデルの位置
	D3DXVECTOR3			rot;				// モデルの向き(回転)
	D3DXVECTOR3			scl;				// モデルの大きさ(スケール)
	

	float				spd;				// 移動スピード
	
	DX11_MODEL			model;				// モデル情報

	D3DXMATRIX			mtxWorld;			// ワールドマトリックス

	int					shadowIdx;			// 影のインデックス番号
	bool				use;
	float				radius;
	INTERPOLATION_DATA	*tbl_adr;
	float				move_time;
	PLAYER				*parent;

};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

PLAYER *GetPlayer(void);

